# PathReinEndHookOrient1Wall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PathReinEndHookOrient1Wall Property
ParameterTypeId Class See Also
---
"Primary Bar - End Hook Orientation"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PathReinEndHookOrient1Wall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PathReinEndHookOrient1Wall As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PathReinEndHookOrient1Wall {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace